{
  "dictionary": "Cөздік",
  "themes": "Лекциялар",
  "tests": "Оқу",
  "tasks": "Тапсырмалар",
  "login": "Кіру",
  "signup": "Тіркелу",
  "log_in": "Кіру",
  "sign_up": "Тіркелу",
  "password": "Құпия сөз",
  "about": "Бұл веб-қосымша туралы",
  "about_us": "IT-ағылшынша білім беру қолданбасы – ақпараттық технологиялар контекстінде ағылшын тілін жетілдіруге ұмтылатын адамдарға арнайы әзірленген тіл үйренуге арналған бағдарламалық құрал. Қолданба оқушыларға сөздік қорын, грамматикасын және техникалық терминдерді түсінуін жақсартуға көмектесу үшін интерактивті сабақтарды, викториналарды және АТ-ға қатысты нақты өмірлік сценарийлерді ұсынады. Ол бағдарламалау, бағдарламалық жасақтаманы әзірлеу, дерекқорды басқару, киберқауіпсіздік және басқа да АТ-қа қатысты тақырыптарды қамтиды. Қолданба өздігінен және сыныпта оқытуға арналған және кәсіби немесе академиялық мақсаттарда ағылшын тілін жақсартуға ұмтылатын адамдар үшін өте қолайлы. Қызықты мазмұнымен, анық түсіндірмелерімен және жан-жақты бағалауымен IT-ағылшынша білім беру қолданбасы IT ағылшын тілін меңгеруді қалайтын кез келген адам үшін құнды ресурс болып табылады.",
  "unit_name": "Бөлімнің атауы",
  "vocabulary": "Сөздік",
  "reading": "Оқу",
  "activities": "Тапсырмалар",
  "logout": "Шығу",
  "profile": "Профиль",
  "auth/email-already-in-use": "Пошта тіркелген",
  "auth/weak-password": "Құпия сөз тым қысқа",
  "auth/user-not-found": "Пайдаланушы табылмады",
  "auth/wrong-password": "Құпия сөз немесе пайдаланушы аты дұрыс емес",
  "changeAvatar": "Өзгерту",
  "username": "Поштаңыз",
  "first_name": "Аты",
  "last_name": "Тегі",
  "features": "Орнатулар",
  "feature_1": "Сөздік мүмкіндігі: Бұл мүмкіндік пайдаланушыларға АТ және технологияға қатысты жаңа сөздер мен сөз тіркестерін үйренуге көмектесу үшін жасалған. Ол сөздер мен анықтамалар кітапханасын, сондай-ақ пайдаланушыларға тәжірибе жасауға және білімдерін бекітуге көмектесетін интерактивті жаттығулар мен викториналарды қамтуы мүмкін. Сондай-ақ, пайдаланушылар уақыт өте келе үлгерімін қадағалай алады және қызығушылықтары мен шеберлік деңгейіне қарай үйренуге арналған жаңа сөздерге арналған жекелендірілген ұсыныстарды ала алады.",
  "feature_2": "Оқу мүмкіндігі: Бұл мүмкіндік пайдаланушыларға IT-байланысты тақырыптарға назар аудара отырып, ағылшын тілінде оқуды түсінуді жақсартуға көмектесу үшін жасалған. Ол пайдаланушыларға оқи алатын және талдай алатын мақалаларды немесе басқа мәтіндерді, сондай-ақ пайдаланушыларға жаңа сөздік пен ұғымдарды түсінуге көмектесетін интерактивті құралдарды қамтуы мүмкін. Сондай-ақ, пайдаланушыларға олардың түсінуін тексеруге және олардың уақыт өте келе үлгерімін бақылауға көмектесетін викториналар немесе басқа бағалаулар болуы мүмкін.",
  "feature_3": "Әрекеттер мүмкіндігі: Бұл мүмкіндік пайдаланушыларға ағылшын тілін интерактивті және тартымды түрде үйренуге көмектесу үшін жасалған. Ол викториналар, басқатырғыштар, рөлдік ойындар және әңгіме симуляциялары сияқты әртүрлі ойындарды, жаттығуларды және симуляцияларды қамтуы мүмкін. Бұл әрекеттер пайдаланушылардың қызығушылықтары мен дағдылар деңгейлеріне бейімделуі мүмкін және пайдаланушыларға тіл дағдыларын жақсартуға көмектесу үшін дереу кері байланыс пен нұсқаулықты қамтамасыз етуі мүмкін.",
  "modules": "Қолжетімді модульдер",
  "contact_us": "Бізбен хабарласыңы",
  "why_1": "Технологиялар дамып келе жатқандықтан, IT индустриясында ағылшын тілін білу қажеттілігі барған сайын маңызды бола түсуде. Көптеген ірі технологиялық компаниялар, соның ішінде Google, Facebook және Microsoft, ағылшын тілінде сөйлейтін елдерде орналасқан және өз қызметкерлерінен ағылшын тілінде сөйлесуді талап етеді. IT-ағылшын тілін үйрену сізге еңбек нарығында бәсекелестік артықшылық беріп, халықаралық ынтымақтастық пен мансаптық өсу үшін мүмкіндіктер ашады.",
  "why_2": "Additionally, IT English has its own specific terminology and jargon that may not be familiar to non-native speakers. By learning IT English, you can gain a better understanding of these terms and concepts, which can help you communicate more effectively with colleagues and clients in the IT industry. It can also help you navigate technical documentation, online resources, and other materials related to your work.",
  "why_3": "Finally, learning IT English can improve your overall communication skills. Many of the skills required for effective IT communication, such as clarity, precision, and attention to detail, are transferable to other fields and can benefit you in both your personal and professional life. In a globalized world where cross-cultural communication is becoming increasingly important, being proficient in IT English can give you a valuable advantage in navigating diverse professional and social environments.",
  "header_1": "",
  "header_2": "",
  "header_3": "",
  "register": "Сабақтарды көру үшін тіркеліңіз немесе кіріңіз",
  "emailSentSuccessfully": "Электронды пошта сәтті жіберілді",
  "emailFailedToSend": "Электронды пошта жіберу сәтсіз аяқталды",
  "contactUs": "Бізге хабарласыңыз",
  "submit": "Жіберу",
  "name": "аты",
  "email": "электронды пошта",
  "message": "хабарлама",
  "language": "KK",
  "information": "Қолданбаның функционалдығы",
  "sign_in_with_google": "Google кіру"
}
