{
  "dictionary": "Dictionary",
  "themes": "reading",
  "tests": "Tests",
  "tasks": "Tasks",
  "login": "Login",
  "signup": "Signup",
  "log_in": "Log in",
  "sign_up": "Sign up",
  "password": "Password",
  "about": "About this web application",
  "about_us": "An IT English educational app is a language learning software specifically designed for individuals looking to improve their English skills in the context of Information Technology. The app provides interactive lessons, quizzes, and real-life IT-related scenarios to help learners improve their vocabulary, grammar, and comprehension of technical terms. It covers topics such as programming, software development, database management, cybersecurity, and other IT-related subjects. The app is designed for both self-paced and classroom-style learning, and is ideal for individuals seeking to improve their English for professional or academic purposes. With its engaging content, clear explanations, and comprehensive assessment, the IT English educational app is a valuable resource for anyone looking to build their IT English proficiency.",
  "unit_name": "Unit name",
  "vocabulary": "Vocabulary",
  "reading": "Reading",
  "activities": "Activities",
  "logout": "logout",
  "profile": "profile",
  "auth/email-already-in-use": "Email already in use",
  "auth/weak-password": "Password is too weak",
  "auth/user-not-found": "User not found",
  "auth/wrong-password": "Invalid email or password",
  "changeAvatar": "Change",
  "username": "Email",
  "first_name": "First Name",
  "last_name": "Last Name",
  "features": "Features",
  "modules": "Modules",
  "feature_1": "This feature is designed to help users learn new words and phrases related to IT and technology. It might include a library of words and definitions, as well as interactive exercises and quizzes to help users practice and reinforce their knowledge. Users may also be able to track their progress over time and receive personalized recommendations for new words to learn based on their interests and skill level.",
  "feature_2": "This feature is designed to help users improve their reading comprehension in English, with a focus on IT-related topics. It may include articles or other texts that users can read and analyze, as well as interactive tools to help users understand new vocabulary and concepts. There may also be quizzes or other assessments to help users test their comprehension and track their progress over time.",
  "feature_3": "This feature is designed to help users practice their English language skills in a more interactive and engaging way. It may include a variety of games, exercises, and simulations, such as quizzes, puzzles, role-playing activities, and conversation simulations. These activities may be tailored to users' interests and skill levels, and may provide immediate feedback and guidance to help users improve their language skills.",
  "why_1": "As technology continues to evolve, the need for English proficiency in the IT industry becomes increasingly important. Many of the biggest tech companies, including Google, Facebook, and Microsoft, are based in English-speaking countries and require their employees to communicate in English. Learning IT English can give you a competitive edge in the job market and open up opportunities for international collaboration and career advancement.",
  "why_2": "Additionally, IT English has its own specific terminology and jargon that may not be familiar to non-native speakers. By learning IT English, you can gain a better understanding of these terms and concepts, which can help you communicate more effectively with colleagues and clients in the IT industry. It can also help you navigate technical documentation, online resources, and other materials related to your work.",
  "why_3": "Finally, learning IT English can improve your overall communication skills. Many of the skills required for effective IT communication, such as clarity, precision, and attention to detail, are transferable to other fields and can benefit you in both your personal and professional life. In a globalized world where cross-cultural communication is becoming increasingly important, being proficient in IT English can give you a valuable advantage in navigating diverse professional and social environments.",
  "header_1": "IT Vocabulary Builder",
  "header_2": "Reading Comprehension for IT",
  "header_3": "Interactive English Language Practice",
  "register": "Signup or login to get access to lessons",
  "emailSentSuccessfully": "Email sent successfully",
  "emailFailedToSend": "Failed to send email",
  "contact_us": "Contact Us",
  "submit": "Submit",
  "name": "name",
  "email": "email",
  "message": "message"
}
