{
    "dictionary": "словарь",
    "themes": "Лекции",
    "tests": "Чтение",
    "tasks": "Задания",
    "login": "Войти",
    "signup": "Зарегистрироваться",
    "log_in": "Войти",
    "sign_up": "Зарегистрироваться",
    "password": "Пароль",
    "about": "Об этом веб приложении",
    "about_us": "Образовательное приложение IT English — это программное обеспечение для изучения языка, специально разработанное для людей, желающих улучшить свои знания английского языка в контексте информационных технологий. Приложение предлагает интерактивные уроки, викторины и сценарии из реальной жизни, связанные с ИТ, чтобы помочь учащимся улучшить свой словарный запас, грамматику и понимание технических терминов. Он охватывает такие темы, как программирование, разработка программного обеспечения, управление базами данных, кибербезопасность и другие предметы, связанные с ИТ. Приложение предназначено как для самостоятельного обучения, так и для обучения в классе, и идеально подходит для людей, стремящихся улучшить свой английский для профессиональных или академических целей. Образовательное приложение IT English с увлекательным контентом, четкими объяснениями и комплексной оценкой является ценным ресурсом для всех, кто хочет повысить уровень владения ИТ-английским языком.",
    "unit_name": "Название раздела",
    "vocabulary": "Словарь",
    "reading": "Чтение",
    "activities": "Задания",
    "logout": "Выйти",
    "profile": "Профиль",
    "auth/email-already-in-use": "Почта уже зарегестрированна",
    "auth/weak-password": "Слишком короткий пароль",
    "auth/user-not-found": "Пользователь не найден",
    "auth/wrong-password": "Неверный пароль или логин",
    "changeAvatar": "Изменить",
    "username": "Ваша почта",
    "first_name": "Имя",
    "last_name": "Фамилия",
    "features": "Особенности",
    "feature_1": "Словарь: Эта функция разработана для помощи пользователям в изучении новых слов и фраз, связанных с IT и технологиями. Она может включать библиотеку слов и определений, а также интерактивные упражнения и викторины, чтобы помочь пользователям практиковать и укреплять свои знания. Пользователи также могут отслеживать свой прогресс со временем и получать персонализированные рекомендации для изучения новых слов на основе своих интересов и уровня навыков.",
    "feature_2": "Чтение: Эта функция разработана для помощи пользователям в улучшении понимания прочитанного на английском языке, с акцентом на темы, связанные с IT. Она может включать статьи или другие тексты, которые пользователи могут читать и анализировать, а также интерактивные инструменты, чтобы помочь пользователям понимать новую лексику и концепции. Также могут быть викторины или другие оценочные инструменты, чтобы помочь пользователям проверять свое понимание и отслеживать свой прогресс со временем.",
    "feature_3": "Упражнения: Эта функция разработана для помощи пользователям в практике своих навыков английского языка более интерактивным и привлекательным способом. Она может включать разнообразные игры, упражнения и симуляции, такие как викторины, головоломки, ролевые игры и симуляции разговоров. Эти упражнения могут быть адаптированы к интересам и уровню навыков пользователей, и могут предоставлять немедленную обратную связь и руководство, чтобы помочь пользователям улучшить свои языковые навыки.",
    "modules": "Доступные модули",
    "contact_us": "Обратная связь",
    "why_1" : "Поскольку технологии продолжают развиваться, потребность во владении английским языком в ИТ-индустрии становится все более важной. Многие крупнейшие технологические компании, в том числе Google, Facebook и Microsoft, базируются в англоязычных странах и требуют, чтобы их сотрудники общались на английском языке. Изучение ИТ-английского может дать вам конкурентное преимущество на рынке труда и открыть возможности для международного сотрудничества и карьерного роста.",
    "why_2" : "Кроме того, в ИТ-английском есть своя специфическая терминология и жаргон, которые могут быть незнакомы людям, для которых английский язык не является родным. Изучая ИТ-английский, вы сможете лучше понять эти термины и концепции, что поможет вам более эффективно общаться с коллегами и клиентами в ИТ-индустрии. Он также может помочь вам ориентироваться в технической документации, онлайн-ресурсах и других материалах, связанных с вашей работой.",
    "why_3" : "Наконец, изучение ИТ-английского может улучшить ваши общие навыки общения. Многие навыки, необходимые для эффективного общения в сфере ИТ, такие как ясность, точность и внимание к деталям, можно перенести в другие области и они могут пригодиться вам как в личной, так и в профессиональной жизни. В глобализированном мире, где межкультурное общение становится все более важным, владение ИТ-английским может дать вам ценное преимущество в навигации в разнообразной профессиональной и социальной среде.",
    "header_1": "",
    "header_2": "",
    "header_3": "",
    "register": "Зарегистрируйтесь или войдите, чтобы увидеть уроки"
}